#pragma once

#include "include/Game.hpp"

typedef struct {
	int x[4];
	int y[4];
	T_DIRECTION rotate;
}T_UNIT;

typedef struct {
	T_UNIT unit[4];
}T_COLLECTION_UNIT;


class Tetris: public Game {

private:
	const T_COLLECTION_UNIT _collectionUnit[7] = 
	{
		{	// прямая
			{{5,5,5,5}, {0,1,2,3}, LEFT},
			{{3,4,5,6}, {0,0,0,0}, UP},
			{{5,5,5,5}, {0,1,2,3}, RIGHT},
			{{3,4,5,6}, {0,0,0,0}, DOWN},
		},
		{	// квадрат
			{{4,5,4,5}, {0,0,1,1}, LEFT},
			{{4,5,4,5}, {0,0,1,1}, UP},
			{{4,5,4,5}, {0,0,1,1}, RIGHT},
			{{4,5,4,5}, {0,0,1,1}, DOWN},
		},
		{	// Г
			{{4,5,4,4}, {0,0,1,2}, LEFT},
			{{4,5,6,6}, {0,0,0,1}, UP},
			{{5,5,4,5}, {0,1,2,2}, RIGHT},
			{{4,4,5,6}, {0,1,1,1}, DOWN},
		},
		{	// L
			{{4,4,4,5}, {0,1,2,2}, LEFT},
			{{4,4,5,6}, {0,1,0,0}, UP},
			{{4,5,5,5}, {0,0,1,2}, RIGHT},
			{{4,5,6,6}, {0,1,1,1}, DOWN},
		},
		{	// "ступенька" прямая
			{{4,5,5,6}, {1,0,1,0}, LEFT},
			{{4,4,5,5}, {0,1,1,2}, UP},
			{{4,5,5,6}, {1,0,1,0}, RIGHT},
			{{4,4,5,5}, {0,1,1,2}, DOWN},
		},
		{	// "ступенька" обратная
			{{4,5,5,6}, {0,0,1,1}, LEFT},
			{{4,4,5,5}, {1,2,1,0}, UP},
			{{4,5,5,6}, {0,0,1,1}, RIGHT},
			{{4,4,5,5}, {1,2,1,0}, DOWN},
		},
		{	// Т
			{{4,5,5,6}, {0,0,1,0}, LEFT},
			{{4,5,5,5}, {1,0,1,2}, UP},
			{{4,5,5,6}, {1,0,1,1}, RIGHT},
			{{4,4,4,5}, {0,1,2,1}, DOWN},
		}
	};

	int _deltaX;
	int _deltaY;
public:
	Tetris(Frame&);
	//void mov(T_DIRECTION);

};
